Revit 2024 API
Surface.GetBoundingBoxUV Method
 Gets the UV bounding box of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public BoundingBoxUV GetBoundingBoxUV()
Visual Basic
Public Function GetBoundingBoxUV As BoundingBoxUV
Visual C++
public:
BoundingBoxUV^ GetBoundingBoxUV()
Return Value
 The UV bounding box of the surface.
Remarks
 The UV bounding box may not be set.
See Also
Surface Class
Autodesk.Revit.DB Namespace